In [1]:
import pandas as pd

In [4]:
# Read the CSV file into a DataFrame

df = pd.read_csv('/Users/pro_jects/Desktop/currency.csv')

In [7]:
# Series is a one dimentional labeled array in Pandas. it can be thought of as a single column of data with labels or indices for each element.
# You can create a Series from various data sources, such as lists, NumPy arrays, or dictionaries

# Create a Series from a list

data = [10,20,30,40,50]
s = pd.Series(data)

print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [8]:
print(s[2])

30

In [9]:
print(s.iloc[3])

40

In [10]:
print(s[1:4])

1    20
2    30
3    40
dtype: int64

In [11]:
s.values

array([10, 20, 30, 40, 50])

In [12]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [13]:
s.shape

(5,)

In [14]:
s.size

5

In [15]:
s.mean()

30.0

In [16]:
s.unique()

array([10, 20, 30, 40, 50])

In [17]:
s.nunique()

5

In [18]:
s.sort_values

<bound method Series.sort_values of 0    10
1    20
2    30
3    40
4    50
dtype: int64>

In [19]:
s.sort_index

<bound method Series.sort_index of 0    10
1    20
2    30
3    40
4    50
dtype: int64>

In [28]:
# Data-Frame is 2 dimentional labeled data strcuture with columns of potentially different data types.
# Think of it as a table where each column represents a variable, and each row represents an observation or data point.
# DataFrames are suitable for a wide range of data, including structured data from CSV files, Excel spreadsheets, SQL databases, and more.

import pandas as pd

# Creating DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25,30,35,28],
        'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}

df = pd.DataFrame(data)

print(df)

      Name  Age           city
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [29]:
# Column Selection:


print(df['Name'])

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [31]:
print(df.iloc[2])

Name        Charlie
Age              35
city    Los Angeles
Name: 2, dtype: object

In [32]:
print(df.iloc[3])

Name      David
Age          28
city    Chicago
Name: 3, dtype: object

In [33]:
print(df.iloc[0])

Name       Alice
Age           25
city    New York
Name: 0, dtype: object

In [35]:
# Slicing

print(df[['Name','Age']])

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28

In [36]:
print(df[1:3])

      Name  Age           city
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [38]:
unique_dates = df['Age'].unique()
unique_dates

array([25, 30, 35, 28])

In [39]:
high_above_102 = df[df['Age'] > 25]
high_above_102

      Name  Age           city
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [40]:
# saving Data Frame

df.to_csv('trading_data.csv', index=False)

In [41]:
df.shape

(4, 3)

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [45]:
df.describe()

             Age
count   4.000000
mean   29.500000
std     4.203173
min    25.000000
25%    27.250000
50%    29.000000
75%    31.250000
max    35.000000

In [46]:
df.head()

      Name  Age           city
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [47]:
df.tail()

      Name  Age           city
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [50]:
print("Mean = ", df.mean())
print("sum = ", df.sum())
print("min = ", df.min())
print("max = ", df.max())

Mean =  Age    29.5
dtype: float64
sum =  Name                       AliceBobCharlieDavid
Age                                         118
city    New YorkSan FranciscoLos AngelesChicago
dtype: object
min =  Name      Alice
Age          25
city    Chicago
dtype: object
max =  Name            David
Age                35
city    San Francisco
dtype: object

/var/folders/jl/8dyc06c55jj94k3z28ctgnzw0000gp/T/ipykernel_4334/72276996.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print("Mean = ", df.mean())